# Реализовать функцию, принимающую несколько параметров,
# описывающих данные пользователя: имя, фамилия, год рождения, город проживания,
# email, телефон. Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.

def person_info(**kwargs):
    for key, value in kwargs.items():
        print('Значение для {} является {}'.format(key,value))

person_info(
    name = input('Имя: '),
    lastname = input('Фамилия: '),
    birthday = input('Год рождения: '),
    town = input('Город проживания: '),
    email = input('Email: '),
    phone = input('Телефон: ')
)
