# Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.

"""Первый вариант"""
def my_func():
    x = float(input('Введите действительное положительное число: '))
    y = int(input('Введите целое отрицательное число: '))
    return x ** y
print(f'Результат возведения x в степень y = {my_func()}')

"""Второй вариант"""
def my_func_2():
    x = float(input('Введите действительное положительное число: '))
    y = int(input('Введите целое отрицательное число: '))
    counter = 1
    result = 1 / x
    while counter < abs(y):
        result = result * (1 / x)
        counter += 1
    return result
print(f'Результат возведения x в степень y = {my_func_2()}')
