# Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
# Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix
# (двух матриц). Результатом сложения должна быть новая матрица.
# Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы
# складываем с первым элементом первой строки второй матрицы и т.д.
list_1 = [[1, 5, 8], [74, 8, 6]]
list_2 = [[14, 56, 5], [12, 3, 3]]

class Matrix():
    def __init__(self, lists):
        self.lists = lists

    def __str__(self):
        return '\n'.join(map(str, self.lists))

    def __add__(self, other):
        matrix = []
        for i in range(len(self.lists)):
            matrix.append([])
            for k in range(len(self.lists[0])):
                matrix[i].append(self.lists[i][k] + other.lists[i][k])
        return '\n'.join(map(str, matrix))

matx_1 = Matrix(list_1)
matx_2 = Matrix(list_2)
print(matx_1 + matx_2)
