# Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
# Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
# толщиной в 1 см * чи сло см толщины полотна. Проверить работу метода.
# Например: 20м * 5000м * 25кг * 5см = 12500 т

class Road:
    def __init__(self, lenght, width):
        self._lenght = lenght
        self._width = width
        self.weight = 22
        self.height = 4

    def mass_of_asphalt(self):
        mass = self._lenght * self._width * self.weight * self.height / 1000
        print(f'Масса асфальта, необходимая для покрытия одного кв метра дороги асфальтом равна = {mass}')


r = Road(16, 17)
r.mass_of_asphalt()